#Заполните массив элементами арифметической прогрессии. Её первый элемент, разность и количество
#элементов нужно ввести с клавиатуры. Формула для получения n-го члена прогрессии: an = a1 + (n-1) * d. Каждое число вводится с новой строки.

a1= int(input("Введите первый элемент последовательности a1 "))
d = int(input("Введите разность d "))
n = int(input("Введите количество элементов последовательности n "))

def arifm_prog(a1,d,n):
    an = a1 + (n-1) * d
    return an

for i in range(n): 
    print(arifm_prog(a1,d,i+1))
