lst= [[1, 'A', 'E', 'I', 'O', 'U', 'L', 'N', 'S', 'T', 'R'],
[2, 'D', 'G'],
[3, 'B', 'C', 'M', 'P'],
[4, 'F', 'H', 'V', 'W', 'Y'],
[5, 'K'],
[8, 'J', 'X'],
[10, 'Q', 'Z'],
[1, 'А', 'В', 'Е', 'И', 'Н', 'О', 'Р', 'С', 'Т'],
[2, 'Д', 'К', 'Л', 'М', 'П', 'У'],
[3, 'Б', 'Г', 'Ё', 'Ь', 'Я'],
[4, 'Й', 'Ы'],
[5, 'Ж', 'З', 'Х', 'Ц', 'Ч'],
[8, 'Ш', 'Э', 'Ю'],
[10, 'Ф', 'Щ', 'Ъ']]

str = input("Введите любое слово ")
#print(str)
list_1 = tuple(str)
s = 0
i = 0
while (i < len(list_1)):
    j = 0
    while (j < len(lst)):
        p = 0
        while (p < len(lst[j])):
            if list_1[i] == lst[j][p]:
                s += lst[j][0]
            p += 1
        j += 1
    i += 1
print(s)   

